<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 2 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T01:33:44Z [(view log)](https://github.com/perchnet/p/actions/runs/16868877091/job/47779907707#step:11:1).
</summary>

```hcl

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 111, in module "cloud_init_files":
 111:     length(trimspace(coalesce(var.ci_snippets_storage, ""))) > 0 ||
    ├────────────────
    │ while calling coalesce(vals...)
    │ var.ci_snippets_storage is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 112, in module "cloud_init_files":
 112:     length(trimspace(coalesce(var.ci_meta_data_contents, ""))) > 0 ||
    ├────────────────
    │ while calling coalesce(vals...)
    │ var.ci_meta_data_contents is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 113, in module "cloud_init_files":
 113:     length(trimspace(coalesce(var.ci_network_data_contents, ""))) > 0 ||
    ├────────────────
    │ while calling coalesce(vals...)
    │ var.ci_network_data_contents is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 114, in module "cloud_init_files":
 114:     length(trimspace(coalesce(var.ci_user_data_contents, ""))) > 0 ||
    ├────────────────
    │ while calling coalesce(vals...)
    │ var.ci_user_data_contents is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 115, in module "cloud_init_files":
 115:     length(trimspace(coalesce(var.ci_vendor_data_contents, ""))) > 0
    ├────────────────
    │ while calling coalesce(vals...)
    │ var.ci_vendor_data_contents is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.
images["debian_trixie"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-13-genericcloud-amd64-a110.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"]: Refreshing state... [id=zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img]
module.debian13.module.cloud_image.proxmox_virtual_environment_download_file.image: Refreshing state... [id=local:iso/debian-13-generic-amd64.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img]
module.ubuntu22.module.cloud_image.proxmox_virtual_environment_download_file.image: Refreshing state... [id=local:iso/ubuntu-22.04-server-cloudimg-amd64.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img]
module.vm_minimal_config.proxmox_virtual_environment_file.ci_user_data_file[0]: Refreshing state... [id=snippets:snippets/g6IilJ.user-data.yaml]
module.ubuntu22.proxmox_virtual_environment_vm.vm_template: Refreshing state... [id=8022]
module.vm_minimal_config.proxmox_virtual_environment_vm.vm: Refreshing state... [id=10000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # tailscale_tailnet_key.tailscale_key must be replaced
-/+ resource "tailscale_tailnet_key" "tailscale_key" {
      ~ created_at    = "2025-08-10T22:27:31Z" -> (known after apply)
      ~ expires_at    = "2025-08-10T22:37:31Z" -> (known after apply)
      ~ id            = "k56pDn7mHT11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
      ~ reusable      = false -> true # forces replacement
        tags          = [
            "tag:web-ingress",
        ]
      + user_id       = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-11T01:07:09Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "10000"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ scsi_hardware           = "virtio-scsi-pci" -> "virtio-scsi-single"
      ~ started                 = false -> true
        # (23 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.vm_minimal_config.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = (known after apply)
        }
      + output = (known after apply)
    }

  # module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (known after apply)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-43-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->